/*Даны 2 целочисленных массива nums1 и nums2, они отсортированы в неубывающем порядке. И 2 числа m и n, которые представляют количество элементов массивов nums1 и nums2 соответственно.
  Объедините nums1 и nums2 в один массив, элементы которого отсортированы в неубывающем порядке.
  Конечный отсортированный массив не должен быть возвращен функцией, а вместо этого должен храниться внутри массива nums1.
  В связи с этим, nums1 имеет длину m + n, где первые m элементов обозначают элементы, которые должны быть объединены,
   а последние n элементов имеют значение 0 и должны игнорироваться.*/
public class Lesson1 {

}
